Pandas

In [2]:
import numpy as np

In [3]:
import pandas as pd   # import pandas library

#### Pandas Series

it is 1 dimensional (1-D)array holding data as any time 

A pandas series is like a column in a table

pandas series can be created using list

In [4]:
l = [10,20,30]
s = pd.Series(l)
print(s)

0    10
1    20
2    30
dtype: int64

In [5]:
type(s)

pandas.core.series.Series

In [6]:
s.shape

(3,)

In [7]:
l = [10,20,30]
s = pd.Series(l,index=['a','b','c'])
print(s)

a    10
b    20
c    30
dtype: int64

Create series using 1-D array

In [8]:
l = np.array([10,20,30])
s = pd.Series(l)
print(s)

0    10
1    20
2    30
dtype: int32

### Pandas DataFrame

* A pandas Datafreame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns

1. Create Dataframe using dictionary

In [9]:
d = {'col1':[1,2], 'col2':[3,4]}
s = pd.Series(d)
print(s)

col1    [1, 2]
col2    [3, 4]
dtype: object

In [10]:
d = {'col1':[1,2], 'col2':[3,4]}

df = pd.DataFrame(d)
print(df)

   col1  col2
0     1     3
1     2     4

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df.shape

(2, 2)

Create data frame using nested list

In [13]:
data = [[1,2,3],[4,5,6]]
df = pd.DataFrame(data, columns = ['a','b','c'])
print(df)

   a  b  c
0  1  2  3
1  4  5  6

create dataframe using 2-D array

In [14]:
arr= np.array([[1,3,5],[4,6,5],[5,6,7]])  
df = pd.DataFrame(arr, index=['a','b','c'], columns=['h','i','j'])
print(df)

   h  i  j
a  1  3  5
b  4  6  5
c  5  6  7

In [15]:
df.ndim

2

In [16]:
df.shape

(3, 3)

### Pandas

In [17]:
df = pd.DataFrame({'Age': [26,38,41,32,39],'Salary':[28000,42000,60000,55000,50000],'Gender':['M','F','F','M','F']})
print(df)

   Age  Salary Gender
0   26   28000      M
1   38   42000      F
2   41   60000      F
3   32   55000      M
4   39   50000      F

Set index

In [18]:
d = df.set_index('Age')
print(d)

     Salary Gender
Age
26    28000      M
38    42000      F
41    60000      F
32    55000      M
39    50000      F

Reset index

In [19]:
df.reset_index()
print(d)

     Salary Gender
Age
26    28000      M
38    42000      F
41    60000      F
32    55000      M
39    50000      F

Drop a single row

In [20]:
df = df.drop(index=[3])
print(df)

   Age  Salary Gender
0   26   28000      M
1   38   42000      F
2   41   60000      F
4   39   50000      F

drop multiple rows

In [21]:
print(df)

   Age  Salary Gender
0   26   28000      M
1   38   42000      F
2   41   60000      F
4   39   50000      F

In [22]:
df1 = df.drop(index=[0,1,2])
print(df1)

   Age  Salary Gender
4   39   50000      F

Drop a single column

In [23]:
df1 = df.drop(columns=['Age'])
print(df1)

   Salary Gender
0   28000      M
1   42000      F
2   60000      F
4   50000      F

Drop multiple columns

In [24]:
df1 = df.drop(columns=['Age','Gender'])
print(df1)

   Salary
0   28000
1   42000
2   60000
4   50000

Sorting values in ascending order

In [25]:
df = df.sort_values(by='Age', ascending = True)
print(df)

   Age  Salary Gender
0   26   28000      M
1   38   42000      F
4   39   50000      F
2   41   60000      F

In [26]:
df= df.sort_values(by='Salary', ascending=True)
print(df)

   Age  Salary Gender
0   26   28000      M
1   38   42000      F
4   39   50000      F
2   41   60000      F

Sorting values in Descending order

In [27]:
df = df.sort_values(by='Age', ascending = False)
print(df)

   Age  Salary Gender
2   41   60000      F
4   39   50000      F
1   38   42000      F
0   26   28000      M

### Conmbining Data Frames

In [28]:
df1 = pd.DataFrame({'city':['mumbai','delhi','banglore','hyderabad'],'temperature':[32,45,40,36]})
df1

        city  temperature
0     mumbai           32
1      delhi           45
2   banglore           40
3  hyderabad           36

In [29]:
df2 = pd.DataFrame({'city':['mumbai','delhi','banglore','chennai'],'humidity':[68,65,75,70]})
df2

       city  humidity
0    mumbai        68
1     delhi        65
2  banglore        75
3   chennai        70

#### Concatenation

In [30]:
pd.concat([df1,df2], axis=1)

        city  temperature      city  humidity
0     mumbai           32    mumbai        68
1      delhi           45     delhi        65
2   banglore           40  banglore        75
3  hyderabad           36   chennai        70

In [31]:
pd.concat([df1,df2], axis=0)

        city  temperature  humidity
0     mumbai         32.0       NaN
1      delhi         45.0       NaN
2   banglore         40.0       NaN
3  hyderabad         36.0       NaN
0     mumbai          NaN      68.0
1      delhi          NaN      65.0
2   banglore          NaN      75.0
3    chennai          NaN      70.0

In [32]:
pd.concat([df1,df2], ignore_index=True)

        city  temperature  humidity
0     mumbai         32.0       NaN
1      delhi         45.0       NaN
2   banglore         40.0       NaN
3  hyderabad         36.0       NaN
4     mumbai          NaN      68.0
5      delhi          NaN      65.0
6   banglore          NaN      75.0
7    chennai          NaN      70.0

#### Merging of DataFrame

In [35]:
# Left join
df_left = pd.merge(df1,df2, on = 'city', how = 'left')
df_left

        city  temperature  humidity
0     mumbai           32      68.0
1      delhi           45      65.0
2   banglore           40      75.0
3  hyderabad           36       NaN

In [36]:
#right join
df_right = pd.merge(df1,df2, on='city', how='right')
df_right

       city  temperature  humidity
0    mumbai         32.0        68
1     delhi         45.0        65
2  banglore         40.0        75
3   chennai          NaN        70

In [38]:
#inner joine ---> common records 
df_inner=pd.merge(df1,df2, on='city', how='inner')
df_inner

       city  temperature  humidity
0    mumbai           32        68
1     delhi           45        65
2  banglore           40        75

In [39]:
# outer join --->all records of all data frames 
df_outer=pd.merge(df1,df2, on='city',how='outer')
df_outer

        city  temperature  humidity
0   banglore         40.0      75.0
1    chennai          NaN      70.0
2      delhi         45.0      65.0
3  hyderabad         36.0       NaN
4     mumbai         32.0      68.0